[33mb4bd5558222248f88378f44e48c16f8713d0e877[m[33m ([m[1;36mHEAD -> [m[1;32mmaster[m[33m)[m 添加了删除功能
[33m9f5bf20f0620b18dd5f1bd69554b52ab9bcb857e[m 提交状态
[33md9bc781903c1aa893452023d1d58abcdf8c3a4ae[m[33m ([m[1;32mdev[m[33m)[m 添加了信息
[33mf53d025d727c099caec5ee39f42a67060b634076[m 重新提交了代码
[33m137379e5fe79af039d2d1cf79157bb4c529d43c5[m 提交有冲突的代码
[33m9599d7ebbe34cc02fa0e2291e630b73d1212d900[m 提交新的知识
[33m549df67687ac4005b2a926ba1349ad8fb5d0c2c6[m 提交了一次分支
[33m1eba86eae49ace0088ca5a02856d6b65ca4053b8[m[33m ([m[1;31morigin/master[m[33m, [m[1;31morigin/HEAD[m[33m)[m 合并分支并且提交了
[33m2fd4bfe92875cbdcb7bb989c387803cbbffca34c[m 第一次分之内容提交
[33mb0be517996aff7814830f9e3e4a3db338b6a0f0d[m 创建分支
[33mb4ead9fc5c158eb1b0449b88ad06b3591816e431[m 简单的进行了一次修改
[33ma683f1e5044f21e23ec3b1d4de13045a0a7d0489[m 做了一次提交修改
[33m26476850391ac9f30194a72863cf76abbe0c0af1[m 删除了a文件操作
[33mb974aa8a9d2bd558de820b1ae920ebc8012c0aba[m 学习从暂存区回退到工作区从仓库退回到暂存区
[33m16f0e5b4db9930bf584e4dff47397fa8e47d87dc[m 删除了一段文字
[33m461c728a01d067f2ef25a891ac19cc03e3fedddf[m 这是研究checkout使用方法的模块
[33mac17dcdcbea6fc612ac11402a68aac6d5a6beb35[m 我修改了名字
[33mbe03c58174ce1bf9251d4c1e26e91c163a44f438[m 我已经重新提交了最新的代码
[33m5f807bb4d13c6a26f605fd516917856374f668b2[m 还有一个文件没有提交下次再提交
[33m81a9781a269c43c8f8098aac5972c48842a25d1d[m 将所有的文件重新提交上去
[33m1b23ecff7614c7cd8fc1edf78436c005aed4ca71[m 第一次修改文件
[33m04db1724364afd11b1ef0ca9ec3e80a4dff74fc7[m 添加了3个文件
